GopalSaraf/Practicals/PSDL/include/proc/pic16f1508.inc
// Register: CLC3GLS2
#define CLC3GLS2 CLC3GLS2
CLC3GLS2                                 equ 0F26h
// bitfield definitions
CLC3GLS2_LC3G3D1N_POSN                   equ 0000h
CLC3GLS2_LC3G3D1N_POSITION               equ 0000h
CLC3GLS2_LC3G3D1N_SIZE                   equ 0001h
CLC3GLS2_LC3G3D1N_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D1N_MASK                   equ 0001h
CLC3GLS2_LC3G3D1T_POSN                   equ 0001h
CLC3GLS2_LC3G3D1T_POSITION               equ 0001h
CLC3GLS2_LC3G3D1T_SIZE                   equ 0001h
CLC3GLS2_LC3G3D1T_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D1T_MASK                   equ 0002h
CLC3GLS2_LC3G3D2N_POSN                   equ 0002h
CLC3GLS2_LC3G3D2N_POSITION               equ 0002h
CLC3GLS2_LC3G3D2N_SIZE                   equ 0001h
CLC3GLS2_LC3G3D2N_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D2N_MASK                   equ 0004h
CLC3GLS2_LC3G3D2T_POSN                   equ 0003h
CLC3GLS2_LC3G3D2T_POSITION               equ 0003h
CLC3GLS2_LC3G3D2T_SIZE                   equ 0001h
CLC3GLS2_LC3G3D2T_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D2T_MASK                   equ 0008h
CLC3GLS2_LC3G3D3N_POSN                   equ 0004h
CLC3GLS2_LC3G3D3N_POSITION               equ 0004h
CLC3GLS2_LC3G3D3N_SIZE                   equ 0001h
CLC3GLS2_LC3G3D3N_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D3N_MASK                   equ 0010h
CLC3GLS2_LC3G3D3T_POSN                   equ 0005h
CLC3GLS2_LC3G3D3T_POSITION               equ 0005h
CLC3GLS2_LC3G3D3T_SIZE                   equ 0001h
CLC3GLS2_LC3G3D3T_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D3T_MASK                   equ 0020h
CLC3GLS2_LC3G3D4N_POSN                   equ 0006h
CLC3GLS2_LC3G3D4N_POSITION               equ 0006h
CLC3GLS2_LC3G3D4N_SIZE                   equ 0001h
CLC3GLS2_LC3G3D4N_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D4N_MASK                   equ 0040h
CLC3GLS2_LC3G3D4T_POSN                   equ 0007h
CLC3GLS2_LC3G3D4T_POSITION               equ 0007h
CLC3GLS2_LC3G3D4T_SIZE                   equ 0001h
CLC3GLS2_LC3G3D4T_LENGTH                 equ 0001h
CLC3GLS2_LC3G3D4T_MASK                   equ 0080h
CLC3GLS2_D1N_POSN                        equ 0000h
CLC3GLS2_D1N_POSITION                    equ 0000h
CLC3GLS2_D1N_SIZE                        equ 0001h
CLC3GLS2_D1N_LENGTH                      equ 0001h
CLC3GLS2_D1N_MASK                        equ 0001h
CLC3GLS2_D1T_POSN                        equ 0001h
CLC3GLS2_D1T_POSITION                    equ 0001h
CLC3GLS2_D1T_SIZE                        equ 0001h
CLC3GLS2_D1T_LENGTH                      equ 0001h
CLC3GLS2_D1T_MASK                        equ 0002h
CLC3GLS2_D2N_POSN                        equ 0002h
CLC3GLS2_D2N_POSITION                    equ 0002h
CLC3GLS2_D2N_SIZE                        equ 0001h
CLC3GLS2_D2N_LENGTH                      equ 0001h
CLC3GLS2_D2N_MASK                        equ 0004h
CLC3GLS2_D2T_POSN                        equ 0003h
CLC3GLS2_D2T_POSITION                    equ 0003h
CLC3GLS2_D2T_SIZE                        equ 0001h
CLC3GLS2_D2T_LENGTH                      equ 0001h
CLC3GLS2_D2T_MASK                        equ 0008h
CLC3GLS2_D3N_POSN                        equ 0004h
CLC3GLS2_D3N_POSITION                    equ 0004h
CLC3GLS2_D3N_SIZE                        equ 0001h
CLC3GLS2_D3N_LENGTH                      equ 0001h
CLC3GLS2_D3N_MASK                        equ 0010h
CLC3GLS2_D3T_POSN                        equ 0005h
CLC3GLS2_D3T_POSITION                    equ 0005h
CLC3GLS2_D3T_SIZE                        equ 0001h
CLC3GLS2_D3T_LENGTH                      equ 0001h
CLC3GLS2_D3T_MASK                        equ 0020h
CLC3GLS2_D4N_POSN                        equ 0006h
CLC3GLS2_D4N_POSITION                    equ 0006h
CLC3GLS2_D4N_SIZE                        equ 0001h
CLC3GLS2_D4N_LENGTH                      equ 0001h
CLC3GLS2_D4N_MASK                        equ 0040h
CLC3GLS2_D4T_POSN                        equ 0007h
CLC3GLS2_D4T_POSITION                    equ 0007h
CLC3GLS2_D4T_SIZE                        equ 0001h
CLC3GLS2_D4T_LENGTH                      equ 0001h
CLC3GLS2_D4T_MASK                        equ 0080h

// Register: CLC3GLS3
#define CLC3GLS3 CLC3GLS3
CLC3GLS3                                 equ 0F27h
// bitfield definitions
CLC3GLS3_LC3G4D1N_POSN                   equ 0000h
CLC3GLS3_LC3G4D1N_POSITION               equ 0000h
CLC3GLS3_LC3G4D1N_SIZE                   equ 0001h
CLC3GLS3_LC3G4D1N_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D1N_MASK                   equ 0001h
CLC3GLS3_LC3G4D1T_POSN                   equ 0001h
CLC3GLS3_LC3G4D1T_POSITION               equ 0001h
CLC3GLS3_LC3G4D1T_SIZE                   equ 0001h
CLC3GLS3_LC3G4D1T_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D1T_MASK                   equ 0002h
CLC3GLS3_LC3G4D2N_POSN                   equ 0002h
CLC3GLS3_LC3G4D2N_POSITION               equ 0002h
CLC3GLS3_LC3G4D2N_SIZE                   equ 0001h
CLC3GLS3_LC3G4D2N_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D2N_MASK                   equ 0004h
CLC3GLS3_LC3G4D2T_POSN                   equ 0003h
CLC3GLS3_LC3G4D2T_POSITION               equ 0003h
CLC3GLS3_LC3G4D2T_SIZE                   equ 0001h
CLC3GLS3_LC3G4D2T_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D2T_MASK                   equ 0008h
CLC3GLS3_LC3G4D3N_POSN                   equ 0004h
CLC3GLS3_LC3G4D3N_POSITION               equ 0004h
CLC3GLS3_LC3G4D3N_SIZE                   equ 0001h
CLC3GLS3_LC3G4D3N_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D3N_MASK                   equ 0010h
CLC3GLS3_LC3G4D3T_POSN                   equ 0005h
CLC3GLS3_LC3G4D3T_POSITION               equ 0005h
CLC3GLS3_LC3G4D3T_SIZE                   equ 0001h
CLC3GLS3_LC3G4D3T_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D3T_MASK                   equ 0020h
CLC3GLS3_LC3G4D4N_POSN                   equ 0006h
CLC3GLS3_LC3G4D4N_POSITION               equ 0006h
CLC3GLS3_LC3G4D4N_SIZE                   equ 0001h
CLC3GLS3_LC3G4D4N_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D4N_MASK                   equ 0040h
CLC3GLS3_LC3G4D4T_POSN                   equ 0007h
CLC3GLS3_LC3G4D4T_POSITION               equ 0007h
CLC3GLS3_LC3G4D4T_SIZE                   equ 0001h
CLC3GLS3_LC3G4D4T_LENGTH                 equ 0001h
CLC3GLS3_LC3G4D4T_MASK                   equ 0080h
CLC3GLS3_G4D1N_POSN                      equ 0000h
CLC3GLS3_G4D1N_POSITION                  equ 0000h
CLC3GLS3_G4D1N_SIZE                      equ 0001h
CLC3GLS3_G4D1N_LENGTH                    equ 0001h
CLC3GLS3_G4D1N_MASK                      equ 0001h
CLC3GLS3_G4D1T_POSN                      equ 0001h
CLC3GLS3_G4D1T_POSITION                  equ 0001h
CLC3GLS3_G4D1T_SIZE                      equ 0001h
CLC3GLS3_G4D1T_LENGTH                    equ 0001h
CLC3GLS3_G4D1T_MASK                      equ 0002h
CLC3GLS3_G4D2N_POSN                      equ 0002h
CLC3GLS3_G4D2N_POSITION                  equ 0002h
CLC3GLS3_G4D2N_SIZE                      equ 0001h
CLC3GLS3_G4D2N_LENGTH                    equ 0001h
CLC3GLS3_G4D2N_MASK                      equ 0004h
CLC3GLS3_G4D2T_POSN                      equ 0003h
CLC3GLS3_G4D2T_POSITION                  equ 0003h
CLC3GLS3_G4D2T_SIZE                      equ 0001h
CLC3GLS3_G4D2T_LENGTH                    equ 0001h
CLC3GLS3_G4D2T_MASK                      equ 0008h
CLC3GLS3_G4D3N_POSN                      equ 0004h
CLC3GLS3_G4D3N_POSITION                  equ 0004h
CLC3GLS3_G4D3N_SIZE                      equ 0001h
CLC3GLS3_G4D3N_LENGTH                    equ 0001h
CLC3GLS3_G4D3N_MASK                      equ 0010h
CLC3GLS3_G4D3T_POSN                      equ 0005h
CLC3GLS3_G4D3T_POSITION                  equ 0005h
CLC3GLS3_G4D3T_SIZE                      equ 0001h
CLC3GLS3_G4D3T_LENGTH                    equ 0001h
CLC3GLS3_G4D3T_MASK                      equ 0020h
CLC3GLS3_G4D4N_POSN                      equ 0006h
CLC3GLS3_G4D4N_POSITION                  equ 0006h
CLC3GLS3_G4D4N_SIZE                      equ 0001h
CLC3GLS3_G4D4N_LENGTH                    equ 0001h
CLC3GLS3_G4D4N_MASK                      equ 0040h
CLC3GLS3_G4D4T_POSN                      equ 0007h
CLC3GLS3_G4D4T_POSITION                  equ 0007h
CLC3GLS3_G4D4T_SIZE                      equ 0001h
CLC3GLS3_G4D4T_LENGTH                    equ 0001h
CLC3GLS3_G4D4T_MASK                      equ 0080h

// Register: CLC4CON
#define CLC4CON CLC4CON
CLC4CON                                  equ 0F28h
// bitfield definitions
CLC4CON_LC4MODE0_POSN                    equ 0000h
CLC4CON_LC4MODE0_POSITION                equ 0000h
CLC4CON_LC4MODE0_SIZE                    equ 0001h
CLC4CON_LC4MODE0_LENGTH                  equ 0001h
CLC4CON_LC4MODE0_MASK                    equ 0001h
CLC4CON_LC4MODE1_POSN                    equ 0001h
CLC4CON_LC4MODE1_POSITION                equ 0001h
CLC4CON_LC4MODE1_SIZE                    equ 0001h
CLC4CON_LC4MODE1_LENGTH                  equ 0001h
CLC4CON_LC4MODE1_MASK                    equ 0002h
CLC4CON_LC4MODE2_POSN                    equ 0002h
CLC4CON_LC4MODE2_POSITION                equ 0002h
CLC4CON_LC4MODE2_SIZE                    equ 0001h
CLC4CON_LC4MODE2_LENGTH                  equ 0001h
CLC4CON_LC4MODE2_MASK                    equ 0004h
CLC4CON_LC4INTN_POSN                     equ 0003h
CLC4CON_LC4INTN_POSITION                 equ 0003h
CLC4CON_LC4INTN_SIZE                     equ 0001h
CLC4CON_LC4INTN_LENGTH                   equ 0001h
CLC4CON_LC4INTN_MASK                     equ 0008h
CLC4CON_LC4INTP_POSN                     equ 0004h
CLC4CON_LC4INTP_POSITION                 equ 0004h
CLC4CON_LC4INTP_SIZE                     equ 0001h
CLC4CON_LC4INTP_LENGTH                   equ 0001h
CLC4CON_LC4INTP_MASK                     equ 0010h
CLC4CON_LC4OUT_POSN                      equ 0005h
CLC4CON_LC4OUT_POSITION                  equ 0005h
CLC4CON_LC4OUT_SIZE                      equ 0001h
CLC4CON_LC4OUT_LENGTH                    equ 0001h
CLC4CON_LC4OUT_MASK                      equ 0020h
CLC4CON_LC4OE_POSN                       equ 0006h
CLC4CON_LC4OE_POSITION                   equ 0006h
CLC4CON_LC4OE_SIZE                       equ 0001h
CLC4CON_LC4OE_LENGTH                     equ 0001h
CLC4CON_LC4OE_MASK                       equ 0040h
CLC4CON_LC4EN_POSN                       equ 0007h
CLC4CON_LC4EN_POSITION                   equ 0007h
CLC4CON_LC4EN_SIZE                       equ 0001h
CLC4CON_LC4EN_LENGTH                     equ 0001h
CLC4CON_LC4EN_MASK                       equ 0080h
CLC4CON_LCMODE0_POSN                     equ 0000h
CLC4CON_LCMODE0_POSITION                 equ 0000h
CLC4CON_LCMODE0_SIZE                     equ 0001h
CLC4CON_LCMODE0_LENGTH                   equ 0001h
CLC4CON_LCMODE0_MASK                     equ 0001h
CLC4CON_LCMODE1_POSN                     equ 0001h
CLC4CON_LCMODE1_POSITION                 equ 0001h
CLC4CON_LCMODE1_SIZE                     equ 0001h
CLC4CON_LCMODE1_LENGTH                   equ 0001h
CLC4CON_LCMODE1_MASK                     equ 0002h
CLC4CON_LCMODE2_POSN                     equ 0002h
CLC4CON_LCMODE2_POSITION                 equ 0002h
CLC4CON_LCMODE2_SIZE                     equ 0001h
CLC4CON_LCMODE2_LENGTH                   equ 0001h
CLC4CON_LCMODE2_MASK                     equ 0004h
CLC4CON_LCINTN_POSN                      equ 0003h
CLC4CON_LCINTN_POSITION                  equ 0003h
CLC4CON_LCINTN_SIZE                      equ 0001h
CLC4CON_LCINTN_LENGTH                    equ 0001h
CLC4CON_LCINTN_MASK                      equ 0008h
CLC4CON_LCINTP_POSN                      equ 0004h
CLC4CON_LCINTP_POSITION                  equ 0004h
CLC4CON_LCINTP_SIZE                      equ 0001h
CLC4CON_LCINTP_LENGTH                    equ 0001h
CLC4CON_LCINTP_MASK                      equ 0010h
CLC4CON_LCOUT_POSN                       equ 0005h
CLC4CON_LCOUT_POSITION                   equ 0005h
CLC4CON_LCOUT_SIZE                       equ 0001h
CLC4CON_LCOUT_LENGTH                     equ 0001h
CLC4CON_LCOUT_MASK                       equ 0020h
CLC4CON_LCOE_POSN                        equ 0006h
CLC4CON_LCOE_POSITION                    equ 0006h
CLC4CON_LCOE_SIZE                        equ 0001h
CLC4CON_LCOE_LENGTH                      equ 0001h
CLC4CON_LCOE_MASK                        equ 0040h
CLC4CON_LCEN_POSN                        equ 0007h
CLC4CON_LCEN_POSITION                    equ 0007h
CLC4CON_LCEN_SIZE                        equ 0001h
CLC4CON_LCEN_LENGTH                      equ 0001h
CLC4CON_LCEN_MASK                        equ 0080h
CLC4CON_LC4MODE_POSN                     equ 0000h
CLC4CON_LC4MODE_POSITION                 equ 0000h
CLC4CON_LC4MODE_SIZE                     equ 0003h
CLC4CON_LC4MODE_LENGTH                   equ 0003h
CLC4CON_LC4MODE_MASK                     equ 0007h

// Register: CLC4POL
#define CLC4POL CLC4POL
CLC4POL                                  equ 0F29h
// bitfield definitions
CLC4POL_LC4G1POL_POSN                    equ 0000h
CLC4POL_LC4G1POL_POSITION                equ 0000h
CLC4POL_LC4G1POL_SIZE                    equ 0001h
CLC4POL_LC4G1POL_LENGTH                  equ 0001h
CLC4POL_LC4G1POL_MASK                    equ 0001h
CLC4POL_LC4G2POL_POSN                    equ 0001h
CLC4POL_LC4G2POL_POSITION                equ 0001h
CLC4POL_LC4G2POL_SIZE                    equ 0001h
CLC4POL_LC4G2POL_LENGTH                  equ 0001h
CLC4POL_LC4G2POL_MASK                    equ 0002h
CLC4POL_LC4G3POL_POSN                    equ 0002h
CLC4POL_LC4G3POL_POSITION                equ 0002h
CLC4POL_LC4G3POL_SIZE                    equ 0001h
CLC4POL_LC4G3POL_LENGTH                  equ 0001h
CLC4POL_LC4G3POL_MASK                    equ 0004h
CLC4POL_LC4G4POL_POSN                    equ 0003h
CLC4POL_LC4G4POL_POSITION                equ 0003h
CLC4POL_LC4G4POL_SIZE                    equ 0001h
CLC4POL_LC4G4POL_LENGTH                  equ 0001h
CLC4POL_LC4G4POL_MASK                    equ 0008h
CLC4POL_LC4POL_POSN                      equ 0007h
CLC4POL_LC4POL_POSITION                  equ 0007h
CLC4POL_LC4POL_SIZE                      equ 0001h
CLC4POL_LC4POL_LENGTH                    equ 0001h
CLC4POL_LC4POL_MASK                      equ 0080h
CLC4POL_G1POL_POSN                       equ 0000h
CLC4POL_G1POL_POSITION                   equ 0000h
CLC4POL_G1POL_SIZE                       equ 0001h
CLC4POL_G1POL_LENGTH                     equ 0001h
CLC4POL_G1POL_MASK                       equ 0001h
CLC4POL_G2POL_POSN                       equ 0001h
CLC4POL_G2POL_POSITION                   equ 0001h
CLC4POL_G2POL_SIZE                       equ 0001h
CLC4POL_G2POL_LENGTH                     equ 0001h
CLC4POL_G2POL_MASK                       equ 0002h
CLC4POL_G3POL_POSN                       equ 0002h
CLC4POL_G3POL_POSITION                   equ 0002h
CLC4POL_G3POL_SIZE                       equ 0001h
CLC4POL_G3POL_LENGTH                     equ 0001h
CLC4POL_G3POL_MASK                       equ 0004h
CLC4POL_G4POL_POSN                       equ 0003h
CLC4POL_G4POL_POSITION                   equ 0003h
CLC4POL_G4POL_SIZE                       equ 0001h
CLC4POL_G4POL_LENGTH                     equ 0001h
CLC4POL_G4POL_MASK                       equ 0008h
CLC4POL_POL_POSN                         equ 0007h
CLC4POL_POL_POSITION                     equ 0007h
CLC4POL_POL_SIZE                         equ 0001h
CLC4POL_POL_LENGTH                       equ 0001h
CLC4POL_POL_MASK                         equ 0080h

// Register: CLC4SEL0
#define CLC4SEL0 CLC4SEL0
CLC4SEL0                                 equ 0F2Ah
// bitfield definitions
CLC4SEL0_LC4D1S0_POSN                    equ 0000h
CLC4SEL0_LC4D1S0_POSITION                equ 0000h
CLC4SEL0_LC4D1S0_SIZE                    equ 0001h
CLC4SEL0_LC4D1S0_LENGTH                  equ 0001h
CLC4SEL0_LC4D1S0_MASK                    equ 0001h
CLC4SEL0_LC4D1S1_POSN                    equ 0001h
CLC4SEL0_LC4D1S1_POSITION                equ 0001h
CLC4SEL0_LC4D1S1_SIZE                    equ 0001h
CLC4SEL0_LC4D1S1_LENGTH                  equ 0001h
CLC4SEL0_LC4D1S1_MASK                    equ 0002h
CLC4SEL0_LC4D1S2_POSN                    equ 0002h
CLC4SEL0_LC4D1S2_POSITION                equ 0002h
CLC4SEL0_LC4D1S2_SIZE                    equ 0001h
CLC4SEL0_LC4D1S2_LENGTH                  equ 0001h
CLC4SEL0_LC4D1S2_MASK                    equ 0004h
CLC4SEL0_LC4D2S0_POSN                    equ 0004h
CLC4SEL0_LC4D2S0_POSITION                equ 0004h
CLC4SEL0_LC4D2S0_SIZE                    equ 0001h
CLC4SEL0_LC4D2S0_LENGTH                  equ 0001h
CLC4SEL0_LC4D2S0_MASK                    equ 0010h
CLC4SEL0_LC4D2S1_POSN                    equ 0005h
CLC4SEL0_LC4D2S1_POSITION                equ 0005h
CLC4SEL0_LC4D2S1_SIZE                    equ 0001h
CLC4SEL0_LC4D2S1_LENGTH                  equ 0001h
CLC4SEL0_LC4D2S1_MASK                    equ 0020h
CLC4SEL0_LC4D2S2_POSN                    equ 0006h
CLC4SEL0_LC4D2S2_POSITION                equ 0006h
CLC4SEL0_LC4D2S2_SIZE                    equ 0001h
CLC4SEL0_LC4D2S2_LENGTH                  equ 0001h
CLC4SEL0_LC4D2S2_MASK                    equ 0040h
CLC4SEL0_D1S0_POSN                       equ 0000h
CLC4SEL0_D1S0_POSITION                   equ 0000h
CLC4SEL0_D1S0_SIZE                       equ 0001h
CLC4SEL0_D1S0_LENGTH                     equ 0001h
CLC4SEL0_D1S0_MASK                       equ 0001h
CLC4SEL0_D1S1_POSN                       equ 0001h
CLC4SEL0_D1S1_POSITION                   equ 0001h
CLC4SEL0_D1S1_SIZE                       equ 0001h
CLC4SEL0_D1S1_LENGTH                     equ 0001h
CLC4SEL0_D1S1_MASK                       equ 0002h
CLC4SEL0_D1S2_POSN                       equ 0002h
CLC4SEL0_D1S2_POSITION                   equ 0002h
CLC4SEL0_D1S2_SIZE                       equ 0001h
CLC4SEL0_D1S2_LENGTH                     equ 0001h
CLC4SEL0_D1S2_MASK                       equ 0004h
CLC4SEL0_D2S0_POSN                       equ 0004h
CLC4SEL0_D2S0_POSITION                   equ 0004h
CLC4SEL0_D2S0_SIZE                       equ 0001h
CLC4SEL0_D2S0_LENGTH                     equ 0001h
CLC4SEL0_D2S0_MASK                       equ 0010h
CLC4SEL0_D2S1_POSN                       equ 0005h
CLC4SEL0_D2S1_POSITION                   equ 0005h
CLC4SEL0_D2S1_SIZE                       equ 0001h
CLC4SEL0_D2S1_LENGTH                     equ 0001h
CLC4SEL0_D2S1_MASK                       equ 0020h
CLC4SEL0_D2S2_POSN                       equ 0006h
CLC4SEL0_D2S2_POSITION                   equ 0006h
CLC4SEL0_D2S2_SIZE                       equ 0001h
CLC4SEL0_D2S2_LENGTH                     equ 0001h
CLC4SEL0_D2S2_MASK                       equ 0040h
CLC4SEL0_LC4D1S_POSN                     equ 0000h
CLC4SEL0_LC4D1S_POSITION                 equ 0000h
CLC4SEL0_LC4D1S_SIZE                     equ 0003h
CLC4SEL0_LC4D1S_LENGTH                   equ 0003h
CLC4SEL0_LC4D1S_MASK                     equ 0007h
CLC4SEL0_LC4D2S_POSN                     equ 0004h
CLC4SEL0_LC4D2S_POSITION                 equ 0004h
CLC4SEL0_LC4D2S_SIZE                     equ 0003h
CLC4SEL0_LC4D2S_LENGTH                   equ 0003h
CLC4SEL0_LC4D2S_MASK                     equ 0070h

// Register: CLC4SEL1
#define CLC4SEL1 CLC4SEL1
CLC4SEL1                                 equ 0F2Bh
// bitfield definitions
CLC4SEL1_LC4D3S0_POSN                    equ 0000h
CLC4SEL1_LC4D3S0_POSITION                equ 0000h
CLC4SEL1_LC4D3S0_SIZE                    equ 0001h
CLC4SEL1_LC4D3S0_LENGTH                  equ 0001h
CLC4SEL1_LC4D3S0_MASK                    equ 0001h
CLC4SEL1_LC4D3S1_POSN                    equ 0001h
CLC4SEL1_LC4D3S1_POSITION                equ 0001h
CLC4SEL1_LC4D3S1_SIZE                    equ 0001h
CLC4SEL1_LC4D3S1_LENGTH                  equ 0001h
CLC4SEL1_LC4D3S1_MASK                    equ 0002h
CLC4SEL1_LC4D3S2_POSN                    equ 0002h
CLC4SEL1_LC4D3S2_POSITION                equ 0002h
CLC4SEL1_LC4D3S2_SIZE                    equ 0001h
CLC4SEL1_LC4D3S2_LENGTH                  equ 0001h
CLC4SEL1_LC4D3S2_MASK                    equ 0004h
CLC4SEL1_LC4D4S0_POSN                    equ 0004h
CLC4SEL1_LC4D4S0_POSITION                equ 0004h
CLC4SEL1_LC4D4S0_SIZE                    equ 0001h
CLC4SEL1_LC4D4S0_LENGTH                  equ 0001h
CLC4SEL1_LC4D4S0_MASK                    equ 0010h
CLC4SEL1_LC4D4S1_POSN                    equ 0005h
CLC4SEL1_LC4D4S1_POSITION                equ 0005h
CLC4SEL1_LC4D4S1_SIZE                    equ 0001h
CLC4SEL1_LC4D4S1_LENGTH                  equ 0001h
CLC4SEL1_LC4D4S1_MASK                    equ 0020h
CLC4SEL1_LC4D4S2_POSN                    equ 0006h
CLC4SEL1_LC4D4S2_POSITION                equ 0006h
CLC4SEL1_LC4D4S2_SIZE                    equ 0001h
CLC4SEL1_LC4D4S2_LENGTH                  equ 0001h
CLC4SEL1_LC4D4S2_MASK                    equ 0040h
CLC4SEL1_D3S0_POSN                       equ 0000h
CLC4SEL1_D3S0_POSITION                   equ 0000h
CLC4SEL1_D3S0_SIZE                       equ 0001h
CLC4SEL1_D3S0_LENGTH                     equ 0001h
CLC4SEL1_D3S0_MASK                       equ 0001h
CLC4SEL1_D3S1_POSN                       equ 0001h
CLC4SEL1_D3S1_POSITION                   equ 0001h
CLC4SEL1_D3S1_SIZE                       equ 0001h
CLC4SEL1_D3S1_LENGTH                     equ 0001h
CLC4SEL1_D3S1_MASK                       equ 0002h
CLC4SEL1_D3S2_POSN                       equ 0002h
CLC4SEL1_D3S2_POSITION                   equ 0002h
CLC4SEL1_D3S2_SIZE                       equ 0001h
CLC4SEL1_D3S2_LENGTH                     equ 0001h
CLC4SEL1_D3S2_MASK                       equ 0004h
CLC4SEL1_D4S0_POSN                       equ 0004h
CLC4SEL1_D4S0_POSITION                   equ 0004h
CLC4SEL1_D4S0_SIZE                       equ 0001h
CLC4SEL1_D4S0_LENGTH                     equ 0001h
CLC4SEL1_D4S0_MASK                       equ 0010h
CLC4SEL1_D4S1_POSN                       equ 0005h
CLC4SEL1_D4S1_POSITION                   equ 0005h
CLC4SEL1_D4S1_SIZE                       equ 0001h
CLC4SEL1_D4S1_LENGTH                     equ 0001h
CLC4SEL1_D4S1_MASK                       equ 0020h
CLC4SEL1_D4S2_POSN                       equ 0006h
CLC4SEL1_D4S2_POSITION                   equ 0006h
CLC4SEL1_D4S2_SIZE                       equ 0001h
CLC4SEL1_D4S2_LENGTH                     equ 0001h
CLC4SEL1_D4S2_MASK                       equ 0040h
CLC4SEL1_LC4D3S_POSN                     equ 0000h
CLC4SEL1_LC4D3S_POSITION                 equ 0000h
CLC4SEL1_LC4D3S_SIZE                     equ 0003h
CLC4SEL1_LC4D3S_LENGTH                   equ 0003h
CLC4SEL1_LC4D3S_MASK                     equ 0007h
CLC4SEL1_LC4D4S_POSN                     equ 0004h
CLC4SEL1_LC4D4S_POSITION                 equ 0004h
CLC4SEL1_LC4D4S_SIZE                     equ 0003h
CLC4SEL1_LC4D4S_LENGTH                   equ 0003h
CLC4SEL1_LC4D4S_MASK                     equ 0070h

